wrk4/wrk_01_w.txt
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9973.760ms, rate sampling interval: 19955ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.55s     0.00us  22.54s     0.00%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    22560.77 ms
 75.000%    22560.77 ms
 90.000%    22560.77 ms
 99.000%    22560.77 ms
 99.900%    22560.77 ms
 99.990%    22560.77 ms
 99.999%    22560.77 ms
100.000%    22560.77 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22560.767     0.000000            1         1.00
   22560.767     1.000000            1          inf
#[Mean    =    22552.576, StdDeviation   =        0.000]
#[Max     =    22544.384, Total count    =            1]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2 requests in 31.09s, 1.85GB read
  Socket errors: connect 0, read 0, write 0, timeout 11
Requests/sec:      0.06
Transfer/sec:     61.02MB